{
  "movies": [
    {
      "title": "Interstellar",
      "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "release_date": "2014-11-05",
      "vote_average": 8.387,
      "vote_count": 30122,
      "genres": "Adventure, Drama, Sci-Fiction",
      "poster_path": "/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg",
      "backdrop_path": "/rAiYTfKGqDCRIIqo664sY9XZIvQ.jpg"
    },
    {
      "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
      "overview": "Siblings Lucy, Edmund, Susan and Peter step through a magical wardrobe and find the land of Narnia. There, they discover a charming, once peaceful kingdom that has been plunged into eternal winter by the evil White Witch, Jadis. Aided by the wise and magnificent lion, Aslan, the children lead Narnia into a spectacular, climactic battle to be free of the Witch's glacial powers forever.",
      "release_date": "2005-12-07",
      "vote_average": 7.1,
      "vote_count": 9057,
      "genres": "Adventure, Family, Fantasy",
      "poster_path": "/iREd0rNCjYdf5Ar0vfaW32yrkm.jpg",
      "backdrop_path": "/tuDhEdza074bA497bO9WFEPs6O6.jpg"
    },
    {
      "title": "Black Panther: Wakanda Forever",
      "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death. As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
      "release_date": "2022-11-09",
      "vote_average": 7.494,
      "vote_count": 1513,
      "genres": "Action, Adventure, Science Fiction",
      "poster_path": "/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
      "backdrop_path": "/xDMIl84Qo5Tsu62c9DGWhmPI67A.jpg"
    },
    {
      "title": "Top Gun: Maverick",
      "overview": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen.",
      "release_date": "2022-05-24",
      "vote_average": 8.343,
      "vote_count": 5289,
      "genres": "Action, Drama",
      "poster_path": "/62HCnUTziyWcpDaBO2i1DX17ljH.jpg",
      "backdrop_path": "/AaV1YIdWKnjAIAOe8UUKBFm327v.jpg"
    },
    {
      "title": "Doctor Strange",
      "overview": "After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under her wing and trains him to defend the world against evil.",
      "release_date": "2016-10-25",
      "vote_average": 7.429,
      "vote_count": 19975,
      "genres": "Action, Adventure, Fantasy",
      "poster_path": "/uGBVj3bEbCoZbDjjl9wTxcygko1.jpg",
      "backdrop_path": "/qUv51IFUvVRAP2379ThmA3eLJx6.jpg"
    },
    {
      "title": "Doctor Strange in the Multiverse of Madness",
      "overview": "Doctor Strange, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
      "release_date": "2022-05-04",
      "vote_average": 7.4,
      "vote_count": 6597,
      "genres": "Fantasy, Action, Adventure",
      "poster_path": "/fwBl3J2aEXru6mrr9Xg8O99Iz2K.jpg",
      "backdrop_path": "/wcKFYIiVDvRURrzglV9kGu7fpfY.jpg"
    },
    {
      "title": "Spider-Man: No Way Home",
      "overview": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
      "release_date": "2021-12-15",
      "vote_average": 8.0,
      "vote_count": 16223,
      "genres": "Action, Adventure, Sci-Fiction",
      "poster_path": "/uJYYizSuA9Y3DCs0qS4qWvHfZg4.jpg",
      "backdrop_path": "/14QbnygCuTO0vl7CAFmPf1fgZfV.jpg"
    },
    {
      "title": "Avengers: Endgame",
      "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
      "release_date": "2019-04-24",
      "vote_average": 8.275,
      "vote_count": 22327,
      "genres": "Adventure, Action, Sci-Fiction",
      "poster_path": "/or06FN3Dka5tukK1e9sl16pB3iy.jpg",
      "backdrop_path": "/7RyHsO4yDXtBv1zUU3mTpHeQ0d5.jpg"
    },
    {
      "title": "The Imitation Game",
      "overview": "Based on the real life story of legendary cryptanalyst Alan Turing, the film portrays the nail-biting race against time by Turing and his brilliant team of code-breakers at Britain's top-secret Government Code and Cypher School at Bletchley Park, during the darkest days of World War II.",
      "release_date": "2014-11-14",
      "vote_average": 8.011,
      "vote_count": 15219,
      "genres": "History, Drama, War",
      "poster_path": "/zSqJ1qFq8NXFfi7JeIYMlzyR0dx.jpg",
      "backdrop_path": "/jFp5aAlGQ1H3gwdORL2urr8dnoN.jpg"
    },
    {
      "title": "Avatar: The Way of Water",
      "overview": "Set more than a decade after the events of the first film, learn the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure.",
      "release_date": "2022-12-14",
      "vote_average": 7.744,
      "vote_count": 2913,
      "genres": "Science Fiction, Adventure, Action",
      "poster_path": "/t6HIqrRAclMCA60NsSmeqe9RmNV.jpg",
      "backdrop_path": "/s16H6tpK2utvwDtzZ8Qy4qm5Emw.jpg"
    }
  ]
}